import {十二長生, 地支, 天干, 宮位} from "@/qimen/type";

const map: Record<天干, Record<地支, 十二長生>> = {
    甲: {
        亥: "長生",
        子: "沐浴",
        丑: "冠帶",
        寅: "臨官",
        卯: "帝旺",
        辰: "衰",
        巳: "病",
        午: "死",
        未: "墓",
        申: "絕",
        酉: "胎",
        戌: "養",
    },
    乙: {
        午: "長生",
        巳: "沐浴",
        辰: "冠帶",
        卯: "臨官",
        寅: "帝旺",
        丑: "衰",
        子: "病",
        亥: "死",
        戌: "墓",
        酉: "絕",
        申: "胎",
        未: "養",
    },
    丙: {
        寅: "長生",
        卯: "沐浴",
        辰: "冠帶",
        巳: "臨官",
        午: "帝旺",
        未: "衰",
        申: "病",
        酉: "死",
        戌: "墓",
        亥: "絕",
        子: "胎",
        丑: "養",
    },
    丁: {
        酉: "長生",
        申: "沐浴",
        未: "冠帶",
        午: "臨官",
        巳: "帝旺",
        辰: "衰",
        卯: "病",
        寅: "死",
        丑: "墓",
        子: "絕",
        亥: "胎",
        戌: "養",
    },
    戊: {
        寅: "長生",
        卯: "沐浴",
        辰: "冠帶",
        巳: "臨官",
        午: "帝旺",
        未: "衰",
        申: "病",
        酉: "死",
        戌: "墓",
        亥: "絕",
        子: "胎",
        丑: "養",
    },
    己: {
        酉: "長生",
        申: "沐浴",
        未: "冠帶",
        午: "臨官",
        巳: "帝旺",
        辰: "衰",
        卯: "病",
        寅: "死",
        丑: "墓",
        子: "絕",
        亥: "胎",
        戌: "養",
    },
    庚: {
        巳: "長生",
        午: "沐浴",
        未: "冠帶",
        申: "臨官",
        酉: "帝旺",
        戌: "衰",
        亥: "病",
        子: "死",
        丑: "墓",
        寅: "絕",
        卯: "胎",
        辰: "養",
    },
    辛: {
        子: "長生",
        亥: "沐浴",
        戌: "冠帶",
        酉: "臨官",
        申: "帝旺",
        未: "衰",
        午: "病",
        巳: "死",
        辰: "墓",
        卯: "絕",
        寅: "胎",
        丑: "養",
    },
    壬: {
        申: "長生",
        酉: "沐浴",
        戌: "冠帶",
        亥: "臨官",
        子: "帝旺",
        丑: "衰",
        寅: "病",
        卯: "死",
        辰: "墓",
        巳: "絕",
        午: "胎",
        未: "養",
    },
    癸: {
        卯: "長生",
        寅: "沐浴",
        丑: "冠帶",
        子: "臨官",
        亥: "帝旺",
        戌: "衰",
        酉: "病",
        申: "死",
        未: "墓",
        午: "絕",
        巳: "胎",
        辰: "養",
    },
};

const get = (tianGan: 天干, diZhi: 地支): 十二長生 => map[tianGan]?.[diZhi];

const cellToZhi = (cell: 宮位): 地支[] => {
    switch (cell) {
        case "坎一宮":
            return ["子"];
        case "艮八宮":
            return ["丑", "寅"];
        case "震三宮":
            return ["卯"];
        case "巽四宮":
            return ["辰", "巳"];
        case "離九宮":
            return ["午"];
        case "坤二宮":
            return ["未", "申"];
        case "兌七宮":
            return ["酉"];
        case "乾六宮":
            return ["戌", "亥"];
        case "中五宮":
            return [];
    }
};

export const TwelveCycleUtil = Object.freeze({
    get,
    cellToZhi,
});
